app/Controllers/CustomerController.php

    public function product() {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`